x = float(input("Введите 1 число "))
y = float(input("Введите 2 число "))
z = float(input("Введите 3 число "))
n0 = 0
s0 = 0
n1 = 0
s1 = 0
if x > 0:
    n1 += 1
    s1 += x
elif x < 0:
    n0 += 1
    s0 += x
if y > 0:
    n1 += 1
    s1 += y
elif y < 0:
    n0 += 1
    s0 += y
if z > 0:
    n1 += 1
    s1 += z
elif z < 0:
    n0 += 1
    s0 += z
print("Количество положительных чисел: " + str(n1)
      + "\nСумма положительных чисел: " + str(s1))
print("Количество отирацельных чисел: " + str(n0)
      + "\nСумма отирацельных чисел: " + str(s0))
