shoplist = ['яблоки', 'манго', 'морковь', 'бананы']
name = 'swaroop'
print(shoplist)
print(name)
# Вырезка из списка
print('Элементы с 1 по 3:', shoplist[1:3])
print('Элементы с 2 до конца:', shoplist[2:])
print('Элементы с 1 по -1:', shoplist[1:-1])
print('Элементы от начала до конца:', shoplist[:]) 
# Вырезка из строки
print('Символы с 1 по 3:', name[1:3])
print('Символы с 2 до конца:', name[2:])
print('Символы с 1 до -1:', name[1:-1])
print('Символы от начала до конца:', name[:])
# можно указать третим элементом шаг вырезки
print('Символ с шагом вырезки 3',name[0:6:3])
shoplist = ['яблоки', 'манго', 'морковь', 'бананы']
print(shoplist[::1])
#['яблоки', 'манго', 'морковь', 'бананы']
print(shoplist[::2])
#['яблоки', 'морковь']
print(shoplist[::3])
#['яблоки', 'бананы']
print(shoplist[::-1])
#['бананы', 'морковь', 'манго', 'яблоки']